from تقدیر import ذریعہ


class ذریعہ_نکتہ(ذریعہ):

    def __init__(خود, چوڑائی, طول, بلندی, خاکے=None, تبدل_ستون=None):
        خود.چوڑائی = چوڑائی
        خود.طول = طول
        خود.بلندی = بلندی
        خود.خاکے = خاکے
        خود.تبدل_ستون = تبدل_ستون or {}

    def کوائف_پانا(خود, سے, تک, چوڑائی, طول, بلندی, خاکے='۸۔۵'):
        if خود.چوڑائی != چوڑائی or خود.طول != طول or (بلندی is not None and بلندی != خود.بلندی):
            return
        if خود.خاکے is not None and خاکے is not None and خود.خاکے != خاکے:
            return

        return super().کوائف_پانا(سے, تک, چوڑائی, طول, بلندی, خاکے='۸۔۵')

    def _نام_ستون(خود, ستون):
        try:
            return خود.تبدل_ستون[ستون]
        except KeyError:
            return ستون

    def _کوائف_بنانا(خود, سے, تک, چوڑائی, طول, بلندی, خاکے):
        raise NotImplementedError
