import calendar
from datetime import timedelta

import numpy as نمپی
import pandas as پاندس


class ذریعہ(object):
    ممکنہ_تاریخیں = None

    def __init__(خود, چوڑائی, طول, بلندی):
        خود.چوڑائی = چوڑائی
        خود.طول = طول
        خود.بلندی = بلندی

        خود.اسلی_تاریخیں = None
        خود.اعداد_دن = None  # type: پاندس.DataFrame
        خود.اعداد_مہینہ = None  # type: پاندس.DataFrame
        خود.دن_ستون = ['بارش', 'شمسی_تابکاری', 'درجہ_حرارت_زیادہ', 'درجہ_حرارت_کم', 'درجہ_حرارت_اوسط']
        خود.مہینہ_ستون = ['مہینہ', 'سال', 'فہرست_سال', 'درجہ_حرارت_زیادہ_م', 'درجہ_حرارت_کم_م',
                          'درجہ_حرارت_اوسط_م', 'شمسی_تابکاری_م', 'بارش_م']

        خود.تریقہ_جمع = {'بارش': 'رقم', 'شمسی_تابکاری': 'رقم', 'درجہ_حرارت_زیادہ': 'اوسط', 'درجہ_حرارت_کم': 'اوسط',
                         'درجہ_حرارت_اوسط': 'اوسط', 'درجہ_حرارت_زیادہ_م': 'اوسط', 'درجہ_حرارت_کم_م': 'اوسط',
                         'درجہ_حرارت_اوسط_م': 'اوسط', 'شمسی_تابکاری_م': 'رقم', 'بارش_م': 'رقم'}

    def اعداد_پانا(خود, سے, تک, rcp=None, ش_ترکار=1, usar_caché=True, دوبارہ_پیدا=False):

        if دوبارہ_پیدا:
            خود.اعداد_پیدا_کرنا(سے=سے, تک=تک, ار_سی_پی=rcp, ش_ترکار=ش_ترکار, usar_caché=usar_caché)
        else:
            if خود.اسلی_تاریخیں is None or (سے < خود.اسلی_تاریخیں[0] or تک > خود.اسلی_تاریخیں[1]):
                خود.اعداد_پیدا_کرنا(سے=سے, تک=تک, ار_سی_پی=rcp, ش_ترکار=ش_ترکار, usar_caché=usar_caché)

        return خود.اعداد_دن[سے:تک]

    def اعداد_پیدا_کرنا(خود, سے, تک, ار_سی_پی, ش_ترکار, usar_caché):

        if خود.ممکنہ_تاریخیں is not None:
            if سے < خود.ممکنہ_تاریخیں[0]:
                raise ValueError()
            if تک > خود.ممکنہ_تاریخیں[1]:
                raise ValueError()

        تاریخیں = پاندس.date_range(سے, تک)

        خود.اعداد_دن = پاندس.DataFrame(index=تاریخیں, columns=خود.دن_ستون)

        اعداد = خود._اعداد_پیدا_کرنا(سے=سے, تک=تک, ر_ح_را=ار_سی_پی, ش_ترکار=ش_ترکار, پہلہ_ہونےولے_اشتمال=usar_caché)

        خود.اعداد_دن.update(اعداد)

        خود.اسلی_تاریخیں = (سے, تک)

    def _اعداد_پیدا_کرنا(خود, سے, تک, ر_ح_را, ش_ترکار, پہلہ_ہونےولے_اشتمال):
        """

        :param سے:
        :type سے:
        :param تک:
        :type تک:
        :param پہلہ_ہونےولے_اشتمال:
        :type پہلہ_ہونےولے_اشتمال:
        :return:
        :rtype: نمپی.ndarray
        """
        raise NotImplementedError

    def اعداد_مہینہ_پیدا_کرنا(خود):

        r = خود.اسلی_تاریخیں

        if r[0].day == 1:
            پہلہ_مہینا = r[0].month
            پہلا_سال = r[0].year
        else:
            پہلہ_مہینا = r[0].month + 1
            if پہلہ_مہینا == 13:
                پہلا_سال = r[0].year
            else:
                پہلہ_مہینا = 1
                پہلا_سال = r[0].year - 1

        if (r[1] + timedelta(1)).month == r[1].month:
            آخرا_مہینا = r[1].month - 1
            if آخرا_مہینا == 0:
                آخرا_مہینا = 12
                آخرا_سال = r[1].year - 1
            else:
                آخرا_سال = r[1].year
        else:
            آخرا_مہینا = r[1].month
            آخرا_سال = r[1].year

        ش_مہینہ = (آخرا_سال - پہلا_سال + 1) * 12 + (آخرا_مہینا - پہلہ_مہینا)

        اعداد_دن = خود.اعداد_دن
        اعداد_مہینہ = خود.اعداد_مہینہ = پاندس.DataFrame(index=range(ش_مہینہ), columns=خود.مہینہ_ستون)

        #
        for سال in range(پہلا_سال, آخرا_سال + 1):
            for م in range(12):
                مہینہ_لمبائی = calendar.monthrange(سال, month=م + 1)
                شروع = مہینہ_لمبائی[0] - 1
                اختتام = مہینہ_لمبائی[1] - 1

                مہینہ_شمار = م + (سال - پہلا_سال) * 12
                اعداد_مہینہ['مہینہ'][مہینہ_شمار] = م + 1
                اعداد_مہینہ['سال'][مہینہ_شمار] = سال
                اعداد_مہینہ['درجہ_حرارت_زیادہ_م'][مہینہ_شمار] = نمپی.mean(اعداد_دن['درجہ_حرارت_زیادہ'][شروع: اختتام])
                اعداد_مہینہ['درجہ_حرارت_کم_م'][مہینہ_شمار] = نمپی.mean(اعداد_دن['درجہ_حرارت_کم'][شروع: اختتام])
                اعداد_مہینہ['درجہ_حرارت_اوسط_م'][مہینہ_شمار] = نمپی.mean(اعداد_دن['درجہ_حرارت_اوسط'][شروع: اختتام])
                اعداد_مہینہ['شمسی_تابکاری_م'][مہینہ_شمار] = نمپی.mean(اعداد_دن['شمسی_تابکاری'][شروع: اختتام])

                # پر ہر مہینہ کا بارش جوڈکے دینا ہے (اور اوسط دینا نہیں).
                اعداد_مہینہ['بارش_م'][مہینہ_شمار] = نمپی.sum(اعداد_دن['بارش'][شروع: اختتام])
