from .آدادوشمار import آدادوشمار
from .ذرائع import مرکسم۵_جال, مرکسم۵, ناسا


class مقام(object):

    def __init__(خود, چوڑائی, طول, بلندی):
        خود.بلندی = بلندی
        خود.طول = طول
        خود.چوڑانی = چوڑائی

    def آدادوشمار_پانا(خود, سے, تک, ذرائع=None, خاکے='۸۔۵ََ'):
        if ذرائع is None:
            ذرائع = [ناسا, مرکسم۵, مرکسم۵_جال]

        آداد = آدادوشمار(سے, تک)
        for ذر in ذرائع:
            آداد += ذر.آدادوشمار_پانا(سے, تک, خود.چوڑانی, خود.طول, خود.بلندی, خاکے=خاکے)
            if not len(آداد.لاپتہ()):
                break
        return آداد
