import unittest

import pandas as pd
import pandas.testing as pdt
from تقدیر۲.ذرائع import مرکسم۵
from تقدیر۲.ذرائع.مرکسم۵ import راستہ_مرکسم_پانا

راستہ_مرکسم۵ = راستہ_مرکسم_پانا()
پیغام = 'مرکسم ۵ کا راستہ نھیں ملی۔'


class امتحان_مرکسم۵(unittest.TestCase):
    @classmethod
    def setUpClass(قسم):
        قسم.ذریعہ = مرکسم۵()

    @staticmethod
    def _پورا(سے, تک, اعداد):
        pdt.assert_index_equal(اعداد.dropna(how='all').index, pd.period_range(سے, تک, freq='D'))

    def _خولا(خود, اعداد):
        خود.assertEqual(اعداد.dropna(how='all').index, 0)

    @unittest.skipIf(راستہ_مرکسم۵ is None, پیغام)
    def test_کوائف_پانا(خود):
        اعداد = خود.ذریعہ.کوائف_پانا('۲۰۵۰۱۲۰۱', '۲۰۵۱۰۱۱۵', چوڑائی=1, طول=1, بلندی=1)
        خود._پورا('۲۰۵۰۱۲۰۱', '۲۰۵۱۰۱۱۵', اعداد)

    @unittest.skipIf(راستہ_مرکسم۵ is None, پیغام)
    def test_خاکے_۰(خود):
        اعداد = خود.ذریعہ.کوائف_پانا('۲۰۵۰۱۲۰۱', '۲۰۵۱۰۱۱۵', چوڑائی=1, طول=1, بلندی=1, خاکے='۰')
        خود._پورا('۲۰۵۰۱۲۰۱', '۲۰۵۱۰۱۱۵', اعداد)

    @unittest.skipIf(راستہ_مرکسم۵ is None, پیغام)
    def test_خاکے_سحی_نہیں(خود):
        اعداد = خود.ذریعہ.کوائف_پانا('۲۰۵۰۱۲۰۱', '۲۰۵۱۰۱۱۵', چوڑائی=1, طول=1, بلندی=1, خاکے='اسالام علیکم')
        خود._خولا(اعداد)

    @unittest.skipIf(راستہ_مرکسم۵ is None, پیغام)
    def test_سال_کم(خود):
        اعداد = خود.ذریعہ.کوائف_پانا('۱۹۹۹۰۱۰۱', '۲۰۰۰۰۱۰۱', چوڑائی=1, طول=1, بلندی=1)
        خود._پورا('۲۰۵۰۱۲۰۱', '۲۰۵۱۰۱۱۵', اعداد)

    @unittest.skipIf(راستہ_مرکسم۵ is None, پیغام)
    def test_سال_زیادہ(خود):
        اعداد = خود.ذریعہ.کوائف_پانا('۲۱۰۰۰۱۰۱', '۲۱۰۰۰۲۰۱', چوڑائی=1, طول=1, بلندی=1)
        خود._خولا(اعداد)
