import os
import unittest

import pandas as pd
import pandas.testing as pdt
from تقدیر۲.ذرائع import جسان, سی_اس_وی, دیسات
from எண்ணிக்கை import உரைக்கு

راستہ = os.path.split(__file__)[0]
مسل_دیسات = os.path.join(راستہ, 'وسائل/ACNM1301.WTH')
مسل_جسان = os.path.join(راستہ, 'وسائل/روزانہ.json')
مسل_سی_اس_وی = os.path.join(راستہ, 'وسائل/روزانہ.csv')

پای_جسان = {
    "تاریخ": [
        "۲۰۱۳۰۱۰۱",
        "۲۰۱۳۰۱۰۲",
        "۲۰۱۳۰۱۰۳",
        "۲۰۱۳۰۱۰۴",
        "۲۰۱۳۰۱۰۵",
        "۲۰۱۳۰۱۰۶",
        "۲۰۱۳۰۱۰۷",
        "۲۰۱۳۰۱۰۸",
        "۲۰۱۳۰۱۰۹"
    ],
    "شمسی_تابکاری": [
        12.2,
        12.9,
        8.3,
        4.9,
        13.5,
        13.5,
        10.3,
        13.1,
        9.1
    ],
    "درجہ_حرارت_زیادہ": [
        7.8,
        2.2,
        3.3,
        2.8,
        -1.1,
        6.1,
        10.0,
        9.4,
        12.8
    ],
    "درجہ_حرارت_کم": [
        -14.4,
        -13.3,
        -13.3,
        -10.6,
        -8.9,
        -10.6,
        -10.6,
        -8.3,
        -3.9
    ],
    "بارش": [
        0.0,
        0.0,
        0.0,
        0.0,
        0.0,
        0.0,
        0.0,
        0.0,
        0.0
    ]
}
اعداد = pd.DataFrame(
    پای_جسان, columns=[س for س in پای_جسان if س != 'تاریخ'],
    index=pd.PeriodIndex([உரைக்கு(تا, 'latin') for تا in پای_جسان['تاریخ']], freq='D')
)
اعداد['درجہ_حرارت_اوسط'] = (اعداد['درجہ_حرارت_زیادہ']+اعداد['درجہ_حرارت_کم'])/2


class امتحان_ذریعہ_نکتہ(unittest.TestCase):
    @classmethod
    def setUpClass(قسم):
        قسم.جگہ = (34.583, -103.200, 1348)
        تبدل = {'شمسی_تابکاری': 'شمسی تابکاری'}
        قسم.ذرائے = {
            'جسان': جسان(مسل_جسان, *قسم.جگہ, تبدل_ستون=تبدل),
            'پای_جسان': جسان(پای_جسان, *قسم.جگہ),
            'سی_اس_وی': سی_اس_وی(مسل_سی_اس_وی, *قسم.جگہ, تبدل_ستون=تبدل),
            'دیسات': دیسات(مسل_دیسات)
        }

        قسم.خاکے = '۲۔۶'
        قسم.ذرائع_خاکے = {
            'جسان': جسان(مسل_جسان, *قسم.جگہ, خاکے=قسم.خاکے, تبدل_ستون=تبدل),
            'پای_جسان': جسان(پای_جسان, *قسم.جگہ, خاکے=قسم.خاکے),
            'سی_اس_وی': سی_اس_وی(مسل_سی_اس_وی, *قسم.جگہ, خاکے=قسم.خاکے, تبدل_ستون=تبدل),
            'دیسات': دیسات(مسل_دیسات, خاکے=قسم.خاکے)
        }

    def test_کوائف_پانا(خود):
        for نام, ذریہ in خود.ذرائے.items():
            with خود.subTest(نام):
                pdt.assert_frame_equal(ذریہ.کوائف_پانا('۲۰۱۳۰۱۰۱', '۲۰۱۳۰۱۰۹', *خود.جگہ), اعداد, check_like=True)

    def test_bolandi_sahi_nahin(خود):
        pass

    def test_khake_sahi_nahin(خود):
        pass


def _اعداد_ایک_ھی(امتحان, پاندس۱, پاندس۲):
    امتحان.assertSetEqual(set(پاندس۱), set(پاندس۲))
    pdt.assert_index_equal(پاندس۱.index, پاندس۲.index)
    for s in پاندس۱:
        pdt.assert_series_equal(پاندس۱[s], پاندس۲[s])
