import datetime

from tradssat import WTHFile
from تقدیر۲.ذریعہ import ذریعہ_نکتہ


class دیسات(ذریعہ_نکتہ):

    def __init__(خود, مسل, خاکے=None):
        خود.مسل = مسل
        خود.کوائف_دیسات = WTHFile(خود.مسل)

        چوڑائی = خود.کوائف_دیسات.get_value('LAT')
        طول = خود.کوائف_دیسات.get_value('LONG')
        بلندی = خود.کوائف_دیسات.get_value('ELEV')
        super().__init__(چوڑائی, طول, بلندی, خاکے)

    def _کوائف_بھرنا(خود, اعداد_پاندس):
        دیسات_سے_بھرنا(خود.کوائف_دیسات, اعداد_پاندس, سال=None)


def دیسات_سے_بھرنا(مسل, اعداد_پاندس, سال):
    ستون = {
        'بارش': 'RAIN',
        'شمسی_تابکاری': 'SRAD',
        'درجہ_حرارت_زیادہ': 'TMAX',
        'درجہ_حرارت_کم': 'TMIN',
    }

    for ش, تاریخ in enumerate(مسل.get_value('DATE')):
        سال = سال or 2000 + int(str(تاریخ)[:2])
        اسلی_تاریخ = datetime.date(سال, 1, 1) + datetime.timedelta(days=int(str(تاریخ)[-3:]) - 1)

        if اسلی_تاریخ in اعداد_پاندس.index:
            for مت, مت_دیسات in ستون.items():
                اعداد_پاندس.loc[اسلی_تاریخ][مت] = مسل.get_value(مت_دیسات)[ش]
